tests/fixtures/sapo/refunds/list.json

{
  "refunds": [
    {
      "id": 25412855,
      "order_id": 174107276,
      "return_id": null,
      "created_on": "2026-04-30T08:00:09Z",
      "processed_at": "2026-04-30T08:00:09Z",
      "restock": false,
      "user_id": 720560,
      "note": "",
      "transactions": [
        {
          "id": 148464553,
          "parent_id": 148462370,
          "order_id": 174107276,
          "checkout_token": null,
          "refund_id": 25412855,
          "location_id": 825802,
          "source_name": "facebook",
          "client_id": null,
          "user_id": 720560,
          "device_id": null,
          "gateway": "Tiền mặt",
          "amount": 150000.0,
          "currency": "VND",
          "kind": "refund",
          "status": "success",
          "authorization": null,
          "error_code": null,
          "message": null,
          "cause_type": null,
          "payment_info": null,
          "payment_details": {},
          "receipt": {},
          "created_on": "2026-04-30T08:00:09Z",
          "processed_at": "2026-04-30T08:00:09Z",
          "test": false
        }
      ],
      "refund_line_items": [],
      "order_adjustments": [
        {
          "id": 4285078,
          "order_id": 174107276,
          "refund_id": 25412855,
          "kind": "refund_discrepancy",
          "reason": "Refund discrepancy",
          "amount": -150000.0,
          "tax_amount": 0.0
        }
      ],
      "total_refunded": 150000.0
    },
    {
      "id": 25413187,
      "order_id": 174107276,
      "return_id": null,
      "created_on": "2026-04-30T08:05:57Z",
      "processed_at": "2026-04-30T08:05:57Z",
      "restock": false,
      "user_id": 0,
      "note": null,
      "transactions": [],
      "refund_line_items": [
        {
          "id": 31959523,
          "quantity": 1,
          "line_item_id": 290320676,
          "location_id": 825802,
          "subtotal": 150000.0,
          "total_tax": 0.0,
          "restock_type": "no_restock",
          "line_item": {
            "id": 290320676,
            "price": 150000.0,
            "total_discount": 0.0,
            "discount_code": null,
            "fulfillment_status": "fulfilled",
            "fulfillable_quantity": 0,
            "quantity": 1,
            "current_quantity": 0,
            "grams": 100,
            "product_id": 46419129,
            "variant_id": 147237422,
            "inventory_item_id": 147237420,
            "product_exists": true,
            "variant_inventory_management": "bizweb",
            "requires_shipping": true,
            "name": "Sữa tắm Dove",
            "title": "Sữa tắm Dove",
            "variant_title": "Default Title",
            "sku": "SKU30",
            "vendor": null,
            "gift_card": false,
            "properties": [],
            "taxable": false,
            "non_fulfillable_quantity": 0,
            "refundable_quantity": 0,
            "restockable": true,
            "discounted_unit_price": 150000.0,
            "discounted_total": 150000.0,
            "original_total": 150000.0,
            "fulfillment_service": "manual",
            "merchant_editable": false,
            "unit": null,
            "catalog_id": null,
            "note": null,
            "vat_pit_category_code": null,
            "deleted": false
          },
          "total_cart_discount_amount": 0.0
        }
      ],
      "order_adjustments": [
        {
          "id": 4285088,
          "order_id": 174107276,
          "refund_id": 25413187,
          "kind": "refund_discrepancy",
          "reason": "Full return balancing adjustment",
          "amount": 150000.0,
          "tax_amount": 0.0
        }
      ],
      "total_refunded": 0
    }
  ]
}
